<template>
    <div class="mb-[50px] cards-list grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-4 justify-between gap-x-[24px] gap-y-[50px]">        
        <CardNews 
            v-for="item of list" 
            :key="item.id" 
            :newsCard="item"
            />
    </div>
    <button class="upload-btn">Загрузить ещё</button>
    <div class="mt-[20px] pagination flex justify-center gap-[10px]">
        <button 
            v-for="page in pages" 
            :key="page"
            class="pagination__btn"
            :class="{ 'active': currentPage === page }"
            @click="setPage(page)"
            >
            {{ page }}
        </button>
    </div>

</template>

<script setup>
import { ref } from 'vue';
import CardNews from './CardNews.vue';
const currentPage = ref(1);

const pages = [1, 2, 3, 4];

const setPage = (page) => {
  currentPage.value = page;
};

const imagesObj = import.meta.glob('./../assets/img/news/*.webp', { eager: true });
const img = Object.values(imagesObj).map(img => img.default);

const list = ref([
    {
        id: 1,
        img: img[0],
        date: '12.04.2026',
        title: 'ВЕСЕННЕЕ ОБНОВЛЕНИЕ МЕНЮ',
        text: 'Мы&nbsp;рады представить обновлённое сезонное меню! Шеф-повар добавил лёгкие блюда из&nbsp;свежих овощей, авторские салаты и&nbsp;новые десерты с&nbsp;ягодами. Особое внимание&nbsp;&mdash; блюдам на&nbsp;гриле и&nbsp;домашней пасте с&nbsp;новыми соусами. Приходите попробовать вкус весны в&nbsp;нашем ресторане!'
    },
    {
        id: 2,
        img: img[1],
        date: '12.04.2026',
        title: 'ЖИВАЯ МУЗЫКА ПО ПЯТНИЦАМ',
        text: 'Теперь каждую пятницу в&nbsp;19:00&nbsp;в нашем ресторане&nbsp;&mdash; вечер живой музыки. <br>Уютная атмосфера, авторская кухня и&nbsp;качественный звук создадут идеальное настроение для встречи с&nbsp;друзьями или романтического ужина.'
    },
    {
        id: 3,
        img: img[2],
        date: '12.04.2026',
        title: 'БИЗНЕС-ЛАНЧИ С НОВЫМ ФОРМАТОМ',
        text: 'Мы&nbsp;обновили формат бизнес-ланчей! <br>Теперь вы&nbsp;можете собрать свой обед из&nbsp;нескольких вариантов супов, горячих блюд и&nbsp;напитков.<br>Быстро, вкусно и&nbsp;по&nbsp;приятной цене&nbsp;&mdash; идеальное решение для делового обеда.'
    },
    {
        id: 4,
        img: img[3],
        date: '12.04.2026',
        title: 'ПРАЗДНИЧНЫЕ МЕРОПРИЯТИЯ «ПОД КЛЮЧ»',
        text: 'Планируете день рождения, корпоратив или семейное торжество? Наш ресторан предлагает организацию мероприятий «под ключ»: индивидуальное меню, оформление зала и музыкальное сопровождение.'
    },
    {
        id: 5,
        img: img[4],
        date: '12.04.2026',
        title: 'СКИДКА 15% В ДЕНЬ РОЖДЕНИЯ',
        text: 'Дарим скидку 15% именинникам в течение 7 дней до и после даты рождения!<br>Отличный повод собрать близких и отметить праздник в уютной атмосфере.<br>Подробности уточняйте у администратора при бронировании.'
    },
    {
        id: 6,
        img: img[5],
        date: '12.04.2026',
        title: 'ВЕСЕННЕЕ ОБНОВЛЕНИЕ МЕНЮ',
        text: 'Мы рады представить обновлённое сезонное меню! Шеф-повар добавил лёгкие блюда из свежих овощей, авторские салаты и новые десерты с ягодами.<br>Особое внимание — блюдам на гриле и домашней пасте с новыми соусами.<br>Приходите попробовать вкус весны в нашем ресторане!'
    },
    {
        id: 7,
        img: img[6],
        date: '12.04.2026',
        title: 'ЖИВАЯ МУЗЫКА ПО ПЯТНИЦАМ',
        text: 'Теперь каждую пятницу в 19:00 в нашем ресторане — вечер живой музыки. <br>Уютная атмосфера, авторская кухня и качественный звук создадут идеальное настроение для встречи с друзьями или романтического ужина.'
    },
    {
        id: 8,
        img: img[7],
        date: '12.04.2026',
        title: 'БИЗНЕС-ЛАНЧИ С НОВЫМ ФОРМАТОМ',
        text: 'Мы обновили формат бизнес-ланчей!<br>Теперь вы можете собрать свой обед из нескольких вариантов супов, горячих блюд и напитков. <br>Быстро, вкусно и по приятной цене — идеальное решение для делового обеда.'
    },
    {
        id: 9,
        img: img[8],
        date: '12.04.2026',
        title: 'ПРАЗДНИЧНЫЕ МЕРОПРИЯТИЯ «ПОД КЛЮЧ»',
        text: 'Планируете день рождения, корпоратив или семейное торжество? <br>Наш ресторан предлагает организацию мероприятий «под ключ»: индивидуальное меню, оформление зала и музыкальное сопровождение.'
    },
    {
        id: 10,
        img: img[9],
        date: '12.04.2026',
        title: 'ПРАЗДНИЧНЫЕ МЕРОПРИЯТИЯ «ПОД КЛЮЧ»',
        text: 'Планируете день рождения, корпоратив или семейное торжество?<br>Наш ресторан предлагает организацию мероприятий «под ключ»: индивидуальное меню, оформление зала и музыкальное сопровождение.'
    },
    {
        id: 11,
        img: img[10],
        date: '12.04.2026',
        title: 'ВЕСЕННЕЕ ОБНОВЛЕНИЕ МЕНЮ',
        text: 'Мы рады представить обновлённое сезонное меню! Шеф-повар добавил лёгкие блюда из свежих овощей, авторские салаты и новые десерты с ягодами. <br>Особое внимание — блюдам на гриле и домашней пасте с новыми соусами.<br>Приходите попробовать вкус весны в нашем ресторане!'
    },
    {
        id: 12,
        img: img[11],
        date: '12.04.2026',
        title: 'БИЗНЕС-ЛАНЧИ С НОВЫМ ФОРМАТОМ',
        text: 'Мы обновили формат бизнес-ланчей! <br>Теперь вы можете собрать свой обед из нескольких вариантов супов, горячих блюд и напитков. <br>Быстро, вкусно и по приятной цене — идеальное решение для делового обеда.'
    }
])
</script>

<style lang="scss" scoped>
.upload-btn{
    height: 50px;
    width: 100%;
    display: inline-block;
    box-sizing: border-box;
    border: 2px solid $border;
    color: $light-gray;
    &:hover{
        background-color: $dark;
        color: white;
        transition: 0.2s;
    }

}
.pagination{
    &__btn{
        height: 50px;
        width: 50px;
        display: inline-block;
        box-sizing: border-box;
        border: 2px solid $border;
        color: $light-gray;


        &.active, &:hover{
            background-color: $dark;
            color: white;
        }
        &:hover{
            transition: 0.2s;
        }
    }
}
</style>